Second iteration of CMAKE.md
